---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyUInt64
source: html/fac721a0-2427-6f85-5a00-c52b942ab4eb.htm
---
# AssetPropertyUInt64 Members

Adds a new connected asset attached to this asset property, if it allows it.